FemDesign.Supports.SurfaceSupport.#ctor
Parameterless constructor for serialization

FemDesign.Supports.SurfaceSupport.#ctor(FemDesign.Geometry.Region,FemDesign.Releases.RigidityDataType1,System.String)
Create surface support

FemDesign.Supports.SurfaceSupport.#ctor(FemDesign.Geometry.Region,FemDesign.Releases.Motions,System.String)
Create surface support with only translation rigidity defined.

FemDesign.Supports.SurfaceSupport.#ctor(FemDesign.Geometry.Region,FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits,System.String)
Create surface support with only translation rigidity and force plastic limits defined.